declare @dt datetime = '1998/01/31 23:59:59.991'
select @dt

----------------------------------------------------------------------------------------------------
--關於 datetime2
datetime2 小數以下的可達 7 位數 (100 奈秒，10-9秒)
非固定儲存體大小，從 3 ~ 8 Bytes 不等
有效位數，小數位數：0 至 7 位數，精確度為 100ns，預設有效位數是 7 位數
儲存體大小：不到 3 個有效位數為 6 個位元組，3 或4 個有效位數為 7 個位元組，
所有其他有效位數均需要 8 個位元組，但第一個位元組會儲存值的有效位數，所以是 4 ~ 9 Bytes 不等
若 datetime 改用 datetime2，可使用 datetime2(3) 也不會有四捨五入的問題
--以變數為例：

DECLARE @var datetime2 = '2018-06-10 23:59:59.999'
SELECT DATEADD(dd, 1, @var)

----------------------------------------------------------------------------------------------------
--關於 datetimeoffset
datetimeoffset 提供時區支援和時區位移
固定儲存體大小 10 Bytes，使用時不需要指定長度
時區位移指定 time 或 datetime 值從 UTC 算起的時區位移。 時區位移可表示成 [+|-] hh:mm
--以變數為例：

DECLARE @var datetimeoffset = '2018-06-10 23:59:59.999 +08:00'
SELECT DATEADD(dd, 1, @var)


----------------------------------------------------------------------------------------------------
下列範例會比較將字串轉換成各種 date 與 time 資料類型的結果

SELECT   
     CAST('2018-05-08 12:35:29.1234567 +08:00' AS time(7)) AS 'time'   
    ,CAST('2018-05-08 12:35:29.1234567 +08:00' AS date) AS 'date'   
    ,CAST('2018-05-08 12:35:29.123' AS smalldatetime) AS   
        'smalldatetime'   
    ,CAST('2018-05-08 12:35:29.123' AS datetime) AS 'datetime'   
    ,CAST('2018-05-08 12:35:29. 1234567 +08:00' AS datetime2(7)) AS   
        'datetime2'  
    ,CAST('2018-05-08 12:35:29.1234567 +08:00' AS datetimeoffset(7)) AS   
        'datetimeoffset';